In [2]:
import pandas as pd
import sqlite3

In [19]:
con =sqlite3.connect("sql-murder-mystery.db/sql-murder-mystery.db")
cursor=con.cursor()
tables =pd.read_sql("SELECT name FROM sqlite_master WHERE type='table'",con)
print(tables)

                     name
0      crime_scene_report
1         drivers_license
2                  person
3  facebook_event_checkin
4               interview
5      get_fit_now_member
6    get_fit_now_check_in
7                  income
8                solution

In [20]:
df = pd.read_sql("SELECT * FROM solution",con)
df
cursor.execute("DROP TABLE solution")
con.commit()

In [22]:
tables = pd.read_sql("SELECT name FROM sqlite_master WHERE type='table'",con)
tables

                     name
0      crime_scene_report
1         drivers_license
2                  person
3  facebook_event_checkin
4               interview
5      get_fit_now_member
6    get_fit_now_check_in
7                  income

In [24]:
df = pd.read_sql("SELECT * FROM interview",con)
df.head()

   person_id                                         transcript
0      28508                ‘I deny it!’ said the March Hare.\n
1      63713                                                 \n
2      86208      way, and the whole party swam to the shore.\n
3      35267  lessons in here? Why, there’s hardly room for ...
4      33856                                                 \n

In [16]:
df = pd.read_sql("SELECT * FROM solution",con)
df.head()

Empty DataFrame
Columns: [user, value]
Index: []

In [14]:
df = pd.read_sql("SELECT * FROM income WHERE annual_income>60000",con)
df.head()

         ssn  annual_income
0  100169584          64500
1  100300433          74400
2  100366269          73000
3  100749089          61200
4  101173464          78000

In [9]:
df =pd.read_sql("SELECT * FROM crime_scene_report",con)
df

,date,type,description,city
0,20180115,robbery,A Man Dressed as Spider-Man Is on a Robbery Spree,NYC
1,20180115,murder,Life? Dont talk to me about life.,Albany
2,20180115,murder,"Mama, I killed a man, put a gun against his he...",Reno
3,20180215,murder,REDACTED REDACTED REDACTED,SQL City
4,20180215,murder,Someone killed the guard! He took an arrow to ...,SQL City
...,...,...,...,...
1223,20180430,bribery,\n,Garden Grove
1224,20180430,fraud,‘Why not?’ said the March Hare.\n,Houma
1225,20180430,assault,\n,Fontana
1226,20180501,assault,be NO mistake about it: it was neither more no...,Trenton
1227,20180115,murder,Security footage shows that there were 2 witne...,SQL City